{
  "date": "2026-02-22 00:04 UTC",
  "items": [
    {
      "title": "Generative AI analyzes medical data faster than human research teams",
      "summary": "Researchers tested whether generative AI could handle complex medical datasets as well as human experts. In some cases, the AI matched or outperformed teams that had spent months building prediction models.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221060942.htm",
      "image": "",
      "wiki_url": "",
      "category": "AI",
      "hook": "FYI: AI stands for Artificial Intelligence, not Another Idli",
      "question": "Can you now summarize your conference recordings using AI?",
      "images": [],
      "audio": null
    },
    {
      "title": "James Webb Space Telescope captures strange magnetic forces warping Uranus",
      "summary": "For the first time, scientists have mapped Uranus’s upper atmosphere in three dimensions, tracking temperatures and charged particles up to 5,000 kilometers above the clouds. Webb’s sharp vision revealed glowing auroral bands and unexpected dark regions shaped by the planet’s wildly tilted magnetic field.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000303.htm",
      "image": "",
      "wiki_url": "",
      "category": "Physics",
      "hook": "FYI: Physics is the most complex, difficult and interesting subject... second only to you",
      "question": "How's my rizz game?",
      "images": [],
      "audio": null
    },
    {
      "title": "NASA’s Hubble spots nearly invisible “ghost galaxy” made of 99% dark matter",
      "summary": "Astronomers have uncovered one of the most mysterious galaxies ever found — a dim, ghostly object called CDG-2 that is almost entirely made of dark matter. Located 300 million light-years away in the Perseus galaxy cluster, it was discovered in an unusual way: not by its stars, but by four tightly packed globular clusters acting like cosmic breadcrumbs.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000307.htm",
      "image": "",
      "wiki_url": "",
      "category": "Space",
      "hook": "FYI: No one bends space more than you do",
      "question": "Are you the brightest object in the sky?",
      "images": [],
      "audio": null
    },
    {
      "title": "Scientists discover why high altitude protects against diabetes",
      "summary": "Living at high altitude appears to protect against diabetes, and scientists have finally discovered the reason. When oxygen levels drop, red blood cells switch into a new metabolic mode and absorb large amounts of glucose from the blood.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221060952.htm",
      "image": "",
      "wiki_url": "",
      "category": "Biology",
      "hook": "FYI: You have 86 billion neurons. Activate atleast one now and then",
      "question": "What does XNA stand for again?",
      "images": [],
      "audio": null
    },
    {
      "title": "Scientists reveal why human language isn’t like computer code",
      "summary": "Human language may seem messy and inefficient compared to the ultra-compact strings of ones and zeros used by computers—but our brains actually prefer it that way. New research reveals that while digital-style encoding could theoretically compress information more tightly, it would demand far more mental effort from both speaker and listener.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260219040811.htm",
      "image": "",
      "wiki_url": "",
      "category": "Health",
      "hook": "FYI: Eating junk tasty food alone is injurious to mental health of others. #ShareFoodShareHunger",
      "question": "How many flights of stairs today?",
      "images": [],
      "audio": null
    },
    {
      "title": "A spinning gyroscope could finally unlock ocean wave energy",
      "summary": "Ocean waves are a vast and steady source of renewable energy, but capturing their power efficiently has long frustrated engineers. A researcher at The University of Osaka has now explored a bold new approach: a gyroscopic wave energy converter that uses a spinning flywheel inside a floating structure to turn wave motion into electricity.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
      "image": "",
      "wiki_url": "",
      "category": "Environment",
      "hook": "FYI: Don't pluck flowers",
      "question": "Is it okay for immigrants to litter?",
      "images": [],
      "audio": null
    },
    {
      "title": "“Celtic curse” hotspots found in Scotland and Ireland with 1 in 54 at risk",
      "summary": "Researchers have mapped the genetic risk of hemochromatosis across the UK and Ireland for the first time, uncovering striking hotspots in north-west Ireland and the Outer Hebrides. In some regions, around one in 60 people carry the high-risk gene variant linked to iron overload.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000332.htm",
      "image": "",
      "wiki_url": "",
      "category": "Science",
      "hook": "FYI: You are in my conScience all the time :)",
      "question": "You didn't answer. How's my rizz game?",
      "images": [],
      "audio": null
    },
    {
      "title": "Common pneumonia bacterium may fuel Alzheimer’s disease",
      "summary": "A common bacterium best known for causing pneumonia and sinus infections may also play a surprising role in Alzheimer’s disease. Researchers found that Chlamydia pneumoniae can invade the retina and brain, where it sparks inflammation, nerve cell death, and the buildup of amyloid-beta—the hallmark protein linked to Alzheimer’s.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000321.htm",
      "image": "",
      "wiki_url": "",
      "category": "Entrepreneurship",
      "hook": "FYI: Brainpowerzzz has the potential to become a successful startup",
      "question": "Am I correct?",
      "images": [],
      "audio": null
    },
    {
      "title": "Dearest Gentle Reader,",
      "summary": "Happyyyy birthdayyyyy high maintenance. Here's a fact: You are now one year closer to losing the weight bet. And here's another: Ennaku unnai romba pudichirukku. Hehehe.",
      "link": "",
      "wiki_url": "",
      "category": "For you specially",
      "hook": "",
      "question": "",
      "image": "",
      "images": [
        "assets/category/foryou.jpg",
        "assets/category/foryou2.jpg",
        "assets/category/foryou3.jpg"
      ],
      "audio": {
        "src": "assets/audio/song1_ShowMeLove.mp3",
        "title": "Party vibes 🎵"
      }
    }
  ]
}