{
  "date": "2026-02-22 02:54 UTC",
  "items": [
    {
      "title": "Quantum computer breakthrough tracks qubit fluctuations in real time",
      "summary": "Qubits, the heart of quantum computers, can change performance in fractions of a second — but until now, scientists couldn’t see it happening. Researchers at NBI have built a real-time monitoring system that tracks these rapid fluctuations about 100 times faster than previous methods.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260219040756.htm",
      "image": "",
      "wiki_url": "",
      "category": "AI",
      "hook": "FYI: AI stands for Artificial Intelligence, not Another Idli",
      "question": "Can you now summarize your conference recordings using AI?",
      "images": [],
      "audio": null
    },
    {
      "title": "NASA’s Hubble spots nearly invisible “ghost galaxy” made of 99% dark matter",
      "summary": "Astronomers have uncovered one of the most mysterious galaxies ever found — a dim, ghostly object called CDG-2 that is almost entirely made of dark matter. Located 300 million light-years away in the Perseus galaxy cluster, it was discovered in an unusual way: not by its stars, but by four tightly packed globular clusters acting like cosmic breadcrumbs.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000307.htm",
      "image": "",
      "wiki_url": "",
      "category": "Physics",
      "hook": "FYI: Physics is the most complex, difficult and interesting subject... second only to you",
      "question": "How's my rizz game?",
      "images": [],
      "audio": null
    },
    {
      "title": "Your fireplace may be doing more harm than you think",
      "summary": "Home fireplaces and wood stoves are quietly driving a large share of winter air pollution, even though only a small number of households rely on wood heat. Researchers found that wood smoke accounts for over one-fifth of Americans’ winter exposure to dangerous fine particles linked to heart disease and early death.",
      "link": "https://www.sciencedaily.com/releases/2026/01/260126075839.htm",
      "image": "",
      "wiki_url": "",
      "category": "Entrepreneurship",
      "hook": "FYI: Brainpowerzzz has the potential to become a successful startup",
      "question": "Am I correct?",
      "images": [],
      "audio": null
    },
    {
      "title": "James Webb Space Telescope captures strange magnetic forces warping Uranus",
      "summary": "For the first time, scientists have mapped Uranus’s upper atmosphere in three dimensions, tracking temperatures and charged particles up to 5,000 kilometers above the clouds. Webb’s sharp vision revealed glowing auroral bands and unexpected dark regions shaped by the planet’s wildly tilted magnetic field.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000303.htm",
      "image": "",
      "wiki_url": "",
      "category": "Space",
      "hook": "FYI: No one bends space more than you do",
      "question": "Are you the brightest object in the sky?",
      "images": [],
      "audio": null
    },
    {
      "title": "Scientists uncover oxygen-loving ancestor of all complex life",
      "summary": "For decades, scientists have believed that complex life began when two very different microbes joined forces, eventually giving rise to plants, animals, and fungi. But one major puzzle remained: how could these organisms have met if one depended on oxygen and the other supposedly lived without it?",
      "link": "https://www.sciencedaily.com/releases/2026/02/260220010825.htm",
      "image": "",
      "wiki_url": "",
      "category": "Biology",
      "hook": "FYI: You have 86 billion neurons. Activate atleast one now and then",
      "question": "What does XNA stand for again?",
      "images": [],
      "audio": null
    },
    {
      "title": "Scientists discover why high altitude protects against diabetes",
      "summary": "Living at high altitude appears to protect against diabetes, and scientists have finally discovered the reason. When oxygen levels drop, red blood cells switch into a new metabolic mode and absorb large amounts of glucose from the blood.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221060952.htm",
      "image": "",
      "wiki_url": "",
      "category": "Health",
      "hook": "FYI: Eating junk tasty food alone is injurious to mental health of others. #ShareFoodShareHunger",
      "question": "How many flights of stairs today?",
      "images": [],
      "audio": null
    },
    {
      "title": "Scientists just mapped mysterious earthquakes deep inside Earth",
      "summary": "Scientists at Stanford have unveiled the first-ever global map of rare earthquakes that rumble deep within Earth’s mantle rather than its crust. Long debated and notoriously difficult to confirm, these elusive quakes turn out to cluster in regions like the Himalayas and near the Bering Strait.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260219040818.htm",
      "image": "",
      "wiki_url": "",
      "category": "Environment",
      "hook": "FYI: Don't pluck flowers",
      "question": "Is it okay for immigrants to litter?",
      "images": [],
      "audio": null
    },
    {
      "title": "Generative AI analyzes medical data faster than human research teams",
      "summary": "Researchers tested whether generative AI could handle complex medical datasets as well as human experts. In some cases, the AI matched or outperformed teams that had spent months building prediction models.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221060942.htm",
      "image": "",
      "wiki_url": "",
      "category": "Science",
      "hook": "FYI: You are in my conScience all the time :)",
      "question": "You didn't answer. How's my rizz game?",
      "images": [],
      "audio": null
    },
    {
      "title": "Dearest Gentle Reader,",
      "summary": "Happyyyy birthdayyyyy high maintenance. Here's a fact: You are now one year closer to losing the weight bet. And here's another: Ennaku unnai romba pudichirukku. Hehehe.",
      "link": "",
      "wiki_url": "",
      "category": "For you specially",
      "hook": "",
      "question": "",
      "image": "",
      "images": [
        "assets/category/foryou.jpg",
        "assets/category/foryou2.jpg",
        "assets/category/foryou3.jpg",
        "assets/category/foryou4.jpg",
        "assets/category/foryou5.jpg",
        "assets/category/foryou6.jpg"
      ],
      "audio": {
        "src": "assets/audio/song1_ShowMeLove.mp3",
        "title": "Party vibes 🎵"
      }
    }
  ]
}