{
  "date": "2026-02-21 18:21 UTC",
  "items": [
    {
      "title": "Scientists discover why high altitude protects against diabetes",
      "summary": "Living at high altitude appears to protect against diabetes, and scientists have finally discovered the reason. When oxygen levels drop, red blood cells switch into a new metabolic mode and absorb large amounts of glucose from the blood. This helps the body cope with thin air while also reducing blood sugar levels. A drug that recreates this effect reversed diabetes in mice, hinting at a powerful new treatment strategy.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221060952.htm",
      "image": "https://source.unsplash.com/1600x900/?AI%2CScientists%20discover%20why%20high%20altitude%20protects%20against%20diabetes",
      "wiki_url": "",
      "category": "AI"
    },
    {
      "title": "Generative AI analyzes medical data faster than human research teams",
      "summary": "Researchers tested whether generative AI could handle complex medical datasets as well as human experts. In some cases, the AI matched or outperformed teams that had spent months building prediction models. By generating usable analytical code from precise prompts, the systems dramatically reduced the time needed to process health data. The findings hint at a future where AI helps scientists move faster from data to discovery.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221060942.htm",
      "image": "https://source.unsplash.com/1600x900/?AI%2CGenerative%20AI%20analyzes%20medical%20data%20faster%20than%20human%20research%20teams",
      "wiki_url": "",
      "category": "AI"
    },
    {
      "title": "“Celtic curse” hotspots found in Scotland and Ireland with 1 in 54 at risk",
      "summary": "Researchers have mapped the genetic risk of hemochromatosis across the UK and Ireland for the first time, uncovering striking hotspots in north-west Ireland and the Outer Hebrides. In some regions, around one in 60 people carry the high-risk gene variant linked to iron overload. The condition can take decades to surface but may lead to liver cancer and arthritis if untreated.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000332.htm",
      "image": "https://source.unsplash.com/1600x900/?Health%2C%E2%80%9CCeltic%20curse%E2%80%9D%20hotspots%20found%20in%20Scotland%20and%20Ireland%20with%201%20in%2054%20at%20risk",
      "wiki_url": "",
      "category": "Health"
    },
    {
      "title": "Common pneumonia bacterium may fuel Alzheimer’s disease",
      "summary": "A common bacterium best known for causing pneumonia and sinus infections may also play a surprising role in Alzheimer’s disease. Researchers found that Chlamydia pneumoniae can invade the retina and brain, where it sparks inflammation, nerve cell death, and the buildup of amyloid-beta—the hallmark protein linked to Alzheimer’s. Higher levels of the bacterium were found in people with Alzheimer’s, especially those carrying the high-risk APOE4 gene, and were tied to more severe cognitive decline.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000321.htm",
      "image": "https://source.unsplash.com/1600x900/?AI%2CCommon%20pneumonia%20bacterium%20may%20fuel%20Alzheimer%E2%80%99s%20disease",
      "wiki_url": "",
      "category": "AI"
    },
    {
      "title": "NASA’s Hubble spots nearly invisible “ghost galaxy” made of 99% dark matter",
      "summary": "Astronomers have uncovered one of the most mysterious galaxies ever found — a dim, ghostly object called CDG-2 that is almost entirely made of dark matter. Located 300 million light-years away in the Perseus galaxy cluster, it was discovered in an unusual way: not by its stars, but by four tightly packed globular clusters acting like cosmic breadcrumbs.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260221000307.htm",
      "image": "https://source.unsplash.com/1600x900/?Space%2CNASA%E2%80%99s%20Hubble%20spots%20nearly%20invisible%20%E2%80%9Cghost%20galaxy%E2%80%9D%20made%20of%2099%25%20dark%20matter",
      "wiki_url": "",
      "category": "Space"
    },
    {
      "title": "Dearest Gentle Reader,",
      "summary": "A very happy birthday to you.",
      "link": "",
      "image": "assets/category/foryou.jpg",
      "wiki_url": "",
      "category": "For you specially"
    }
  ]
}