{
  "date": "2026-02-26 03:18 UTC",
  "items": [
    {
      "title": "Just two days of oatmeal cut bad cholesterol by 10%",
      "summary": "Eating nothing but oatmeal for just two days might sound extreme, but it delivered a striking payoff in a new clinical trial. People with metabolic syndrome who followed a short, calorie-reduced oat-based plan saw their harmful LDL cholesterol drop by 10%, along with modest weight loss and lower blood pressure. Even more surprising, the cholesterol benefits were still visible six weeks later.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260225081217.htm",
      "image": "https://source.unsplash.com/1600x900/?Health%2CJust%20two%20days%20of%20oatmeal%20cut%20bad%20cholesterol%20by%2010%25",
      "wiki_url": "",
      "category": "Health"
    },
    {
      "title": "NASA study finds ancient life could survive 50 million years in Martian ice",
      "summary": "Mars’ frozen ice caps may be time capsules for ancient life. Lab experiments show that key building blocks of proteins can survive tens of millions of years in pure ice, even under relentless cosmic radiation. Ice mixed with Martian-like soil, however, destroys organic material far more quickly. The findings point future missions toward drilling into clean, buried ice rather than studying rocks or dirt.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260225081147.htm",
      "image": "https://source.unsplash.com/1600x900/?Space%2CNASA%20study%20finds%20ancient%20life%20could%20survive%2050%20million%20years%20in%20Martian%20ice",
      "wiki_url": "",
      "category": "Space"
    },
    {
      "title": "40,000-year-old signs show humans were recording information long before writing",
      "summary": "More than 40,000 years ago, Ice Age humans were carving repeated patterns of dots, lines, and crosses into tools and small ivory figurines. A new computational study of more than 3,000 of these Paleolithic signs reveals that they were not random decorations but structured sequences with measurable complexity. Surprisingly, their information density rivals that of proto-cuneiform, the earliest known writing system that emerged around 3,000 B.C.E.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260225001301.htm",
      "image": "https://source.unsplash.com/1600x900/?Science%2C40%2C000-year-old%20signs%20show%20humans%20were%20recording%20information%20long%20before%20writing",
      "wiki_url": "",
      "category": "Science"
    },
    {
      "title": "Scientists finally solve the mystery of the horse whinny",
      "summary": "Horses have a vocal trick no one fully understood until now. Scientists have discovered that when a horse whinnies, it produces two completely different sounds at the same time. One is a deep tone created by vibrating the vocal folds, similar to how humans sing. The other is a high-pitched whistle generated inside the larynx, something never before confirmed in a large mammal. This rare ability, known as biphonation, likely helps horses send multiple emotional signals in a single call.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260225001256.htm",
      "image": "https://source.unsplash.com/1600x900/?Science%2CScientists%20finally%20solve%20the%20mystery%20of%20the%20horse%20whinny",
      "wiki_url": "",
      "category": "Science"
    },
    {
      "title": "A giant weak spot in Earth’s magnetic field is now half the size of Europe",
      "summary": "Earth’s magnetic shield is shifting in dramatic ways. New data from ESA’s Swarm satellites show that the South Atlantic Anomaly — a vast weak spot in Earth’s magnetic field — has grown by nearly half the size of continental Europe since 2014. Even more striking, a region southwest of Africa has begun weakening even faster in recent years, hinting at unusual activity deep within Earth’s molten outer core.",
      "link": "https://www.sciencedaily.com/releases/2026/02/260224023221.htm",
      "image": "https://source.unsplash.com/1600x900/?Science%2CA%20giant%20weak%20spot%20in%20Earth%E2%80%99s%20magnetic%20field%20is%20now%20half%20the%20size%20of%20Europe",
      "wiki_url": "",
      "category": "Science"
    },
    {
      "title": "Dearest Gentle Reader,",
      "summary": "A very happy birthday to you.",
      "link": "",
      "image": "assets/category/foryou.jpg",
      "wiki_url": "",
      "category": "For you specially"
    }
  ]
}